app/controllers/open_resource/admin/attributes_controller.rb

      def create
        @attribute = @resource.resource_attributes.build(attribute_params)

        if @attribute.save
---
INSERT INTO "open_resource_resource_attributes" ("resource_id", "name", "label", "field_type", "required", "default_value", "position", "filterable", "sortable", "index_visible", "show_visible", "form_visible", "input_options", "validations", "yaml_managed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"