app/controllers/open_resource/admin/resources_controller.rb

      def create
        @resource = Resource.new(resource_params)

        if @resource.save
---
INSERT INTO "open_resource_resources" ("name", "label", "description", "icon", "menu_parent", "menu_priority", "menu_label", "sort_order", "per_page", "actions", "yaml_managed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"